run/tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        boundaryField
        {
            wallFilm
            {
                type            mapped;
                fieldName       Tsf;
                average         300;
                setAverage      no;
                value           uniform 300;
            }
        }
    }

    U
    {
        boundaryField
        {
            wallFilm
            {
                type            mapped;
                fieldName       Usf;
                average         (0 0 0);
                setAverage      no;
                value           uniform (0 0 0);
            }
        }
    }
}

// ************************************************************************* //
